app/controllers/instructions_controller.rb

  def create
    @instruction = Instruction.new(instruction_params)
    @instruction.save
---
INSERT INTO `instructions` (`desc`, `created_at`, `updated_at`) VALUES ('Zdsaddaf', '2016-02-06 19:02:39', '2016-02-06 19:02:39')