app/controllers/tests_controller.rb

SELECT `tests`.* FROM `tests` WHERE (url like ('%tesd%'))
---
  def search
    @tests = Test.where('url like (?)',"%#{params[:url]}%") unless params[:url].nil?